---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FaceSplitterFailures.LoopsOutsideFaceSplitError
source: html/535caf99-8515-86c5-c505-8f7d6eedaa64.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FaceSplitterFailures.LoopsOutsideFaceSplitError Property

Some of the lines drawn lie outside of the boundary of the face being split. All lines used to split a face must be contained
 within the face being split and cannot intersect or overlap any of the boundaries of that face.

## Syntax (C#)
```csharp
public static FailureDefinitionId LoopsOutsideFaceSplitError { get; }
```